max-bot-cf/AccumulationRegisters/энргНачислениеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргНачислениеПени</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтавкаРефинансирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНачисленияПени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочкиСДатыНачалаНачисленийПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачисленияПени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

max-bot-cf/Enums/энргСпособНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСпособНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеПоСреднему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднееПоНормативу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПриборам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНормативу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФормуламРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходПоАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БездоговорноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйОбъем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезучетноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасовоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МощностьНаРозничномРынке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МощностьНаПередачу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПотерь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоГрафикуГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтАктивнойЭнергии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорныеОбъемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостоянныйРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

max-bot-cf/AccumulationRegisters/энргНачислениеПени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура НаборЗаписейОбъемаНачисленийПениЗаПериод(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНаборЗаписейЗаПериод());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, Услуга, Абонент, Регистратор";		
		
		ИмяТаблицы					= "ОбъемНачислений";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, ИмяТаблицы,Параметры.ПараметрыВТ,ДоступныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьЗаписиПоПомещениюДоЗаписи(НаборОбъемНачислений) Экспорт
	
	Запрос  = Новый Запрос(ТекстЗапросаНаборЗаписейПоПомещениюДоЗаписи());
	Запрос.УстановитьПараметр("Регистратор", 	НаборОбъемНачислений.ДополнительныеСвойства["ДокРегистратор"]);
	Запрос.УстановитьПараметр("Организация", 	НаборОбъемНачислений.ДополнительныеСвойства["Организация"]);
	Запрос.УстановитьПараметр("Район", 			НаборОбъемНачислений.ДополнительныеСвойства["Район"]);
	Запрос.УстановитьПараметр("Строение", 		НаборОбъемНачислений.ДополнительныеСвойства["Строение"]);
	Запрос.УстановитьПараметр("Помещение", 		НаборОбъемНачислений.ДополнительныеСвойства["Помещение"]);
	НаборОбъемНачислений.ДополнительныеСвойства.Вставить("ДанныеНабораДоЗаписи", Запрос.Выполнить().Выгрузить());
КонецПроцедуры 

Функция СоздатьНаборЗаписейСОтборомПоРегистратору(Регистратор) Экспорт
	
	Набор  = СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Регистратор);
	
	Возврат Набор;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуНаборомЗаписей(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуНаборомЗаписей());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Регистратор, Период, КлючПомещения";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ОбъемНачислений",Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьНаборЗаписейПоРегистратору(Регистратор) Экспорт
	
	Набор = СоздатьНаборЗаписейСОтборомПоРегистратору(Регистратор);
	Набор.Записать();
	
КонецПроцедуры

Процедура ИсторияПени(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаИсторияПени());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
		
	ДоступныеПараметры 					= "Период, Регистратор, Организация, Район, МКД, Абонент, Услуга, Поставщик, ПериодРасчета, ПериодНачисления";
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргНачислениеПени", ПараметрыОтбора.Отбор, ДоступныеПараметры);		
	КонецЕсли;
		
КонецПроцедуры

Процедура РассчитатьСуммы(СтрокНабора, ДопЧисло = 1)  Экспорт
	
	ПовыщающийКоэффициент 							= Макс(1,СтрокНабора.ПовыщающийКоэффициент);	
	СтрокНабора.Сумма 								= Окр(СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа,2)  * ДопЧисло * ПовыщающийКоэффициент + Окр(СтрокНабора.ОбъемУслугиПотери * СтрокНабора.ЗначениеТарифа,2);
	Если ПовыщающийКоэффициент > 1 Тогда
		СтрокНабора.СуммаПоПовышенномуКоэффициенту 	= Окр(СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа,2) * (ПовыщающийКоэффициент - 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСуммуПоПотребленномуОбъему(СтрокНабора, ДопЧисло = 1)  Экспорт
	
	ПовыщающийКоэффициент 							= Макс(1,СтрокНабора.ПовыщающийКоэффициент);	
	СтрокНабора.Сумма 								= Окр(СтрокНабора.ОбъемУслугиПотребленный * СтрокНабора.ЗначениеТарифа,2) * ДопЧисло * ПовыщающийКоэффициент + + Окр(СтрокНабора.ОбъемУслугиПотребленныйПотери * СтрокНабора.ЗначениеТарифа,2);
	Если ПовыщающийКоэффициент > 1 Тогда
		СтрокНабора.СуммаПоПовышенномуКоэффициенту 	= Окр(СтрокНабора.ОбъемУслугиПотребленный * СтрокНабора.ЗначениеТарифа,2) * (ПовыщающийКоэффициент - 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНеЗначащиеЗаписи(Набор) Экспорт
	
	СтрокиУдалить  = Новый Массив;
	Для Сч = 0 По Набор.Количество() -1 Цикл
		
		Если Набор[Сч].Сумма = 0 Тогда
			СтрокиУдалить.Добавить(Набор[Сч]);
		КонецЕсли;		
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		Набор.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;	
	
 КонецПроцедуры

#Область ПередачаДанныхВБухгалетерию

Процедура НаборЗаписейДляПередачиДанныхПоФактическойСезонности(Схема,Параметры) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе	
		Пакет  = Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбъемыДляПередачиДанныхВБухгалтериюПоФактическомуОбъему());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНаборЗаписейЗаПериод()
	
	Текст =
	"ВЫБРАТЬ
	|	ОбъемНачислений.*
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени КАК ОбъемНачислений
	|		";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьСхемуНаборомЗаписей()
	
	Текст =
	"ВЫБРАТЬ
	|	ОбъемНачислений.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК ОбъемНачислений";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНаборЗаписейПоПомещениюДоЗаписи()
	
	Текст  =
	"ВЫБРАТЬ 
	|	Набор.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК Набор
	|ГДЕ
	|	Набор.Регистратор = &Регистратор
	|	И Набор.Организация = &Организация
	|	И Набор.Район = &Район
	|	И НЕ Набор.Распределение
	|	И Набор.Строение = &Строение
	|	И Набор.Помещение в (&Помещение)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОбъемыДляПередачиДанныхВБухгалтериюПоФактическомуОбъему()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВЫБОР
	|		КОГДА НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|			ТОГДА энргОбъемНачислений.ОбъемУслуги
	|		ИНАЧЕ энргОбъемНачислений.ОбъемУслугиПотребленный
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ВЫБОР
	|		КОГДА НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|			ТОГДА энргОбъемНачислений.ОбъемУслуги
	|		ИНАЧЕ энргОбъемНачислений.ОбъемУслугиПотребленный
	|	КОНЕЦ * энргОбъемНачислений.ЗначениеТарифа КАК Сумма
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|ГДЕ
	|	НЕ энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.КорректировкаСезонныхУслуг)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаИсторияПени()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНачислениеПени.Период КАК Период,
	|	энргНачислениеПени.Регистратор КАК Регистратор,
	|	энргНачислениеПени.Абонент КАК Абонент,
	|	энргНачислениеПени.ПериодРасчета КАК ПериодРасчета,
	|	СУММА(энргНачислениеПени.Сумма) КАК Сумма
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени КАК энргНачислениеПени
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНачислениеПени.Абонент,
	|	энргНачислениеПени.Регистратор,
	|	энргНачислениеПени.Период,
	|	энргНачислениеПени.ПериодРасчета";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
